OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf18855.c
__at(0x011F) __sfr BAUD1CON;
__at(0x011F) volatile __BAUD1CONbits_t BAUD1CONbits;

__at(0x011F) __sfr BAUDCON;
__at(0x011F) volatile __BAUDCONbits_t BAUDCONbits;

__at(0x011F) __sfr BAUDCON1;
__at(0x011F) volatile __BAUDCON1bits_t BAUDCON1bits;

__at(0x011F) __sfr BAUDCTL;
__at(0x011F) volatile __BAUDCTLbits_t BAUDCTLbits;

__at(0x011F) __sfr BAUDCTL1;
__at(0x011F) volatile __BAUDCTL1bits_t BAUDCTL1bits;

__at(0x018C) __sfr SSP1BUF;

__at(0x018D) __sfr SSP1ADD;

__at(0x018E) __sfr SSP1MSK;
__at(0x018E) volatile __SSP1MSKbits_t SSP1MSKbits;

__at(0x018F) __sfr SSP1STAT;
__at(0x018F) volatile __SSP1STATbits_t SSP1STATbits;

__at(0x0190) __sfr SSP1CON1;
__at(0x0190) volatile __SSP1CON1bits_t SSP1CON1bits;

__at(0x0191) __sfr SSP1CON2;
__at(0x0191) volatile __SSP1CON2bits_t SSP1CON2bits;

__at(0x0192) __sfr SSP1CON3;
__at(0x0192) volatile __SSP1CON3bits_t SSP1CON3bits;

__at(0x0196) __sfr SSP2BUF;

__at(0x0197) __sfr SSP2ADD;

__at(0x0198) __sfr SSP2MSK;
__at(0x0198) volatile __SSP2MSKbits_t SSP2MSKbits;

__at(0x0199) __sfr SSP2STAT;
__at(0x0199) volatile __SSP2STATbits_t SSP2STATbits;

__at(0x019A) __sfr SSP2CON1;
__at(0x019A) volatile __SSP2CON1bits_t SSP2CON1bits;

__at(0x019B) __sfr SSP2CON2;
__at(0x019B) volatile __SSP2CON2bits_t SSP2CON2bits;

__at(0x019C) __sfr SSP2CON3;
__at(0x019C) volatile __SSP2CON3bits_t SSP2CON3bits;

__at(0x020C) __sfr TMR1L;
__at(0x020C) volatile __TMR1Lbits_t TMR1Lbits;

__at(0x020D) __sfr TMR1H;
__at(0x020D) volatile __TMR1Hbits_t TMR1Hbits;

__at(0x020E) __sfr T1CON;
__at(0x020E) volatile __T1CONbits_t T1CONbits;

__at(0x020F) __sfr PR1;
__at(0x020F) volatile __PR1bits_t PR1bits;

__at(0x020F) __sfr T1GCON;
__at(0x020F) volatile __T1GCONbits_t T1GCONbits;

__at(0x0210) __sfr T1GATE;
__at(0x0210) volatile __T1GATEbits_t T1GATEbits;

__at(0x0210) __sfr TMR1GATE;
__at(0x0210) volatile __TMR1GATEbits_t TMR1GATEbits;

__at(0x0211) __sfr T1CLK;
__at(0x0211) volatile __T1CLKbits_t T1CLKbits;

__at(0x0211) __sfr TMR1CLK;
__at(0x0211) volatile __TMR1CLKbits_t TMR1CLKbits;

__at(0x0212) __sfr TMR3L;
__at(0x0212) volatile __TMR3Lbits_t TMR3Lbits;

__at(0x0213) __sfr TMR3H;
__at(0x0213) volatile __TMR3Hbits_t TMR3Hbits;

__at(0x0214) __sfr T3CON;
__at(0x0214) volatile __T3CONbits_t T3CONbits;

__at(0x0215) __sfr PR3;
__at(0x0215) volatile __PR3bits_t PR3bits;

__at(0x0215) __sfr T3GCON;
__at(0x0215) volatile __T3GCONbits_t T3GCONbits;

__at(0x0216) __sfr T3GATE;
__at(0x0216) volatile __T3GATEbits_t T3GATEbits;

__at(0x0216) __sfr TMR3GATE;
__at(0x0216) volatile __TMR3GATEbits_t TMR3GATEbits;

__at(0x0217) __sfr T3CLK;
__at(0x0217) volatile __T3CLKbits_t T3CLKbits;

__at(0x0217) __sfr TMR3CLK;
__at(0x0217) volatile __TMR3CLKbits_t TMR3CLKbits;

__at(0x0218) __sfr TMR5L;
__at(0x0218) volatile __TMR5Lbits_t TMR5Lbits;

__at(0x0219) __sfr TMR5H;
__at(0x0219) volatile __TMR5Hbits_t TMR5Hbits;

__at(0x021A) __sfr T5CON;
__at(0x021A) volatile __T5CONbits_t T5CONbits;

__at(0x021B) __sfr PR5;
__at(0x021B) volatile __PR5bits_t PR5bits;

__at(0x021B) __sfr T5GCON;
__at(0x021B) volatile __T5GCONbits_t T5GCONbits;

__at(0x021C) __sfr T5GATE;
__at(0x021C) volatile __T5GATEbits_t T5GATEbits;

__at(0x021C) __sfr TMR5GATE;
__at(0x021C) volatile __TMR5GATEbits_t TMR5GATEbits;

__at(0x021D) __sfr T5CLK;
__at(0x021D) volatile __T5CLKbits_t T5CLKbits;

__at(0x021D) __sfr TMR5CLK;
__at(0x021D) volatile __TMR5CLKbits_t TMR5CLKbits;

__at(0x021E) __sfr CCPTMRS0;
__at(0x021E) volatile __CCPTMRS0bits_t CCPTMRS0bits;

__at(0x021F) __sfr CCPTMRS1;
__at(0x021F) volatile __CCPTMRS1bits_t CCPTMRS1bits;

__at(0x028C) __sfr T2TMR;

__at(0x028C) __sfr TMR2;

__at(0x028D) __sfr PR2;

__at(0x028D) __sfr T2PR;

__at(0x028E) __sfr T2CON;
__at(0x028E) volatile __T2CONbits_t T2CONbits;

__at(0x028F) __sfr T2HLT;
__at(0x028F) volatile __T2HLTbits_t T2HLTbits;

__at(0x0290) __sfr T2CLKCON;
__at(0x0290) volatile __T2CLKCONbits_t T2CLKCONbits;

__at(0x0291) __sfr T2RST;
__at(0x0291) volatile __T2RSTbits_t T2RSTbits;

__at(0x0292) __sfr T4TMR;

__at(0x0292) __sfr TMR4;

__at(0x0293) __sfr PR4;

__at(0x0293) __sfr T4PR;

__at(0x0294) __sfr T4CON;
__at(0x0294) volatile __T4CONbits_t T4CONbits;

__at(0x0295) __sfr T4HLT;
__at(0x0295) volatile __T4HLTbits_t T4HLTbits;

__at(0x0296) __sfr T4CLKCON;
__at(0x0296) volatile __T4CLKCONbits_t T4CLKCONbits;

__at(0x0297) __sfr T4RST;
__at(0x0297) volatile __T4RSTbits_t T4RSTbits;

__at(0x0298) __sfr T6TMR;

__at(0x0298) __sfr TMR6;

__at(0x0299) __sfr PR6;

__at(0x0299) __sfr T6PR;

__at(0x029A) __sfr T6CON;
__at(0x029A) volatile __T6CONbits_t T6CONbits;

__at(0x029B) __sfr T6HLT;
__at(0x029B) volatile __T6HLTbits_t T6HLTbits;

__at(0x029C) __sfr T6CLKCON;
__at(0x029C) volatile __T6CLKCONbits_t T6CLKCONbits;

__at(0x029D) __sfr T6RST;
__at(0x029D) volatile __T6RSTbits_t T6RSTbits;

__at(0x030C) __sfr CCPR1;

__at(0x030C) __sfr CCPR1L;

__at(0x030D) __sfr CCPR1H;

__at(0x030E) __sfr CCP1CON;
__at(0x030E) volatile __CCP1CONbits_t CCP1CONbits;

__at(0x030F) __sfr CCP1CAP;
__at(0x030F) volatile __CCP1CAPbits_t CCP1CAPbits;

__at(0x0310) __sfr CCPR2;

__at(0x0310) __sfr CCPR2L;

__at(0x0311) __sfr CCPR2H;

__at(0x0312) __sfr CCP2CON;
__at(0x0312) volatile __CCP2CONbits_t CCP2CONbits;

__at(0x0313) __sfr CCP2CAP;
__at(0x0313) volatile __CCP2CAPbits_t CCP2CAPbits;

__at(0x0314) __sfr CCPR3;

__at(0x0314) __sfr CCPR3L;

__at(0x0315) __sfr CCPR3H;

__at(0x0316) __sfr CCP3CON;
__at(0x0316) volatile __CCP3CONbits_t CCP3CONbits;

__at(0x0317) __sfr CCP3CAP;
__at(0x0317) volatile __CCP3CAPbits_t CCP3CAPbits;

__at(0x0318) __sfr CCPR4;

__at(0x0318) __sfr CCPR4L;

__at(0x0319) __sfr CCPR4H;

__at(0x031A) __sfr CCP4CON;
__at(0x031A) volatile __CCP4CONbits_t CCP4CONbits;

__at(0x031B) __sfr CCP4CAP;
__at(0x031B) volatile __CCP4CAPbits_t CCP4CAPbits;

__at(0x031C) __sfr CCPR5;

__at(0x031C) __sfr CCPR5L;

__at(0x031D) __sfr CCPR5H;

__at(0x031E) __sfr CCP5CON;
__at(0x031E) volatile __CCP5CONbits_t CCP5CONbits;

__at(0x031F) __sfr CCP5CAP;
__at(0x031F) volatile __CCP5CAPbits_t CCP5CAPbits;

