OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf18855.c
__at(0x038C) __sfr PWM6DCL;
__at(0x038C) volatile __PWM6DCLbits_t PWM6DCLbits;

__at(0x038D) __sfr PWM6DCH;
__at(0x038D) volatile __PWM6DCHbits_t PWM6DCHbits;

__at(0x038E) __sfr PWM6CON;
__at(0x038E) volatile __PWM6CONbits_t PWM6CONbits;

__at(0x0390) __sfr PWM7DCL;
__at(0x0390) volatile __PWM7DCLbits_t PWM7DCLbits;

__at(0x0391) __sfr PWM7DCH;
__at(0x0391) volatile __PWM7DCHbits_t PWM7DCHbits;

__at(0x0392) __sfr PWM7CON;
__at(0x0392) volatile __PWM7CONbits_t PWM7CONbits;

__at(0x040C) __sfr SCANLADRL;
__at(0x040C) volatile __SCANLADRLbits_t SCANLADRLbits;

__at(0x040D) __sfr SCANLADRH;
__at(0x040D) volatile __SCANLADRHbits_t SCANLADRHbits;

__at(0x040E) __sfr SCANHADRL;
__at(0x040E) volatile __SCANHADRLbits_t SCANHADRLbits;

__at(0x040F) __sfr SCANHADRH;
__at(0x040F) volatile __SCANHADRHbits_t SCANHADRHbits;

__at(0x0410) __sfr SCANCON0;
__at(0x0410) volatile __SCANCON0bits_t SCANCON0bits;

__at(0x0411) __sfr SCANTRIG;
__at(0x0411) volatile __SCANTRIGbits_t SCANTRIGbits;

__at(0x0416) __sfr CRCDATA;

__at(0x0416) __sfr CRCDATL;
__at(0x0416) volatile __CRCDATLbits_t CRCDATLbits;

__at(0x0417) __sfr CRCDATH;
__at(0x0417) volatile __CRCDATHbits_t CRCDATHbits;

__at(0x0418) __sfr CRCACC;

__at(0x0418) __sfr CRCACCL;
__at(0x0418) volatile __CRCACCLbits_t CRCACCLbits;

__at(0x0419) __sfr CRCACCH;
__at(0x0419) volatile __CRCACCHbits_t CRCACCHbits;

__at(0x041A) __sfr CRCSHFT;

__at(0x041A) __sfr CRCSHIFTL;
__at(0x041A) volatile __CRCSHIFTLbits_t CRCSHIFTLbits;

__at(0x041B) __sfr CRCSHIFTH;
__at(0x041B) volatile __CRCSHIFTHbits_t CRCSHIFTHbits;

__at(0x041C) __sfr CRCXOR;

__at(0x041C) __sfr CRCXORL;
__at(0x041C) volatile __CRCXORLbits_t CRCXORLbits;

__at(0x041D) __sfr CRCXORH;
__at(0x041D) volatile __CRCXORHbits_t CRCXORHbits;

__at(0x041E) __sfr CRCCON0;
__at(0x041E) volatile __CRCCON0bits_t CRCCON0bits;

__at(0x041F) __sfr CRCCON1;
__at(0x041F) volatile __CRCCON1bits_t CRCCON1bits;

__at(0x048C) __sfr SMT1TMR;

__at(0x048C) __sfr SMT1TMRL;
__at(0x048C) volatile __SMT1TMRLbits_t SMT1TMRLbits;

__at(0x048D) __sfr SMT1TMRH;
__at(0x048D) volatile __SMT1TMRHbits_t SMT1TMRHbits;

__at(0x048E) __sfr SMT1TMRU;
__at(0x048E) volatile __SMT1TMRUbits_t SMT1TMRUbits;

__at(0x048F) __sfr SMT1CPR;

__at(0x048F) __sfr SMT1CPRL;
__at(0x048F) volatile __SMT1CPRLbits_t SMT1CPRLbits;

__at(0x0490) __sfr SMT1CPRH;
__at(0x0490) volatile __SMT1CPRHbits_t SMT1CPRHbits;

__at(0x0491) __sfr SMT1CPRU;
__at(0x0491) volatile __SMT1CPRUbits_t SMT1CPRUbits;

__at(0x0492) __sfr SMT1CPW;

__at(0x0492) __sfr SMT1CPWL;
__at(0x0492) volatile __SMT1CPWLbits_t SMT1CPWLbits;

__at(0x0493) __sfr SMT1CPWH;
__at(0x0493) volatile __SMT1CPWHbits_t SMT1CPWHbits;

__at(0x0494) __sfr SMT1CPWU;
__at(0x0494) volatile __SMT1CPWUbits_t SMT1CPWUbits;

__at(0x0495) __sfr SMT1PR;

__at(0x0495) __sfr SMT1PRL;
__at(0x0495) volatile __SMT1PRLbits_t SMT1PRLbits;

__at(0x0496) __sfr SMT1PRH;
__at(0x0496) volatile __SMT1PRHbits_t SMT1PRHbits;

__at(0x0497) __sfr SMT1PRU;
__at(0x0497) volatile __SMT1PRUbits_t SMT1PRUbits;

__at(0x0498) __sfr SMT1CON0;
__at(0x0498) volatile __SMT1CON0bits_t SMT1CON0bits;

__at(0x0499) __sfr SMT1CON1;
__at(0x0499) volatile __SMT1CON1bits_t SMT1CON1bits;

__at(0x049A) __sfr SMT1STAT;
__at(0x049A) volatile __SMT1STATbits_t SMT1STATbits;

__at(0x049B) __sfr SMT1CLK;
__at(0x049B) volatile __SMT1CLKbits_t SMT1CLKbits;

__at(0x049C) __sfr SMT1SIG;
__at(0x049C) volatile __SMT1SIGbits_t SMT1SIGbits;

__at(0x049D) __sfr SMT1WIN;
__at(0x049D) volatile __SMT1WINbits_t SMT1WINbits;

__at(0x050C) __sfr SMT2TMR;

__at(0x050C) __sfr SMT2TMRL;
__at(0x050C) volatile __SMT2TMRLbits_t SMT2TMRLbits;

__at(0x050D) __sfr SMT2TMRH;
__at(0x050D) volatile __SMT2TMRHbits_t SMT2TMRHbits;

__at(0x050E) __sfr SMT2TMRU;
__at(0x050E) volatile __SMT2TMRUbits_t SMT2TMRUbits;

__at(0x050F) __sfr SMT2CPR;

__at(0x050F) __sfr SMT2CPRL;
__at(0x050F) volatile __SMT2CPRLbits_t SMT2CPRLbits;

__at(0x0510) __sfr SMT2CPRH;
__at(0x0510) volatile __SMT2CPRHbits_t SMT2CPRHbits;

__at(0x0511) __sfr SMT2CPRU;
__at(0x0511) volatile __SMT2CPRUbits_t SMT2CPRUbits;

__at(0x0512) __sfr SMT2CPW;

__at(0x0512) __sfr SMT2CPWL;
__at(0x0512) volatile __SMT2CPWLbits_t SMT2CPWLbits;

__at(0x0513) __sfr SMT2CPWH;
__at(0x0513) volatile __SMT2CPWHbits_t SMT2CPWHbits;

__at(0x0514) __sfr SMT2CPWU;
__at(0x0514) volatile __SMT2CPWUbits_t SMT2CPWUbits;

__at(0x0515) __sfr SMT2PR;

__at(0x0515) __sfr SMT2PRL;
__at(0x0515) volatile __SMT2PRLbits_t SMT2PRLbits;

__at(0x0516) __sfr SMT2PRH;
__at(0x0516) volatile __SMT2PRHbits_t SMT2PRHbits;

__at(0x0517) __sfr SMT2PRU;
__at(0x0517) volatile __SMT2PRUbits_t SMT2PRUbits;

__at(0x0518) __sfr SMT2CON0;
__at(0x0518) volatile __SMT2CON0bits_t SMT2CON0bits;

__at(0x0519) __sfr SMT2CON1;
__at(0x0519) volatile __SMT2CON1bits_t SMT2CON1bits;

__at(0x051A) __sfr SMT2STAT;
__at(0x051A) volatile __SMT2STATbits_t SMT2STATbits;

__at(0x051B) __sfr SMT2CLK;
__at(0x051B) volatile __SMT2CLKbits_t SMT2CLKbits;

__at(0x051C) __sfr SMT2SIG;
__at(0x051C) volatile __SMT2SIGbits_t SMT2SIGbits;

__at(0x051D) __sfr SMT2WIN;
__at(0x051D) volatile __SMT2WINbits_t SMT2WINbits;

__at(0x058C) __sfr NCO1ACC;

__at(0x058C) __sfr NCO1ACCL;
__at(0x058C) volatile __NCO1ACCLbits_t NCO1ACCLbits;

__at(0x058D) __sfr NCO1ACCH;
__at(0x058D) volatile __NCO1ACCHbits_t NCO1ACCHbits;

__at(0x058E) __sfr NCO1ACCU;
__at(0x058E) volatile __NCO1ACCUbits_t NCO1ACCUbits;

__at(0x058F) __sfr NCO1INC;

__at(0x058F) __sfr NCO1INCL;
__at(0x058F) volatile __NCO1INCLbits_t NCO1INCLbits;

__at(0x0590) __sfr NCO1INCH;
__at(0x0590) volatile __NCO1INCHbits_t NCO1INCHbits;

__at(0x0591) __sfr NCO1INCU;
__at(0x0591) volatile __NCO1INCUbits_t NCO1INCUbits;

__at(0x0592) __sfr NCO1CON;
__at(0x0592) volatile __NCO1CONbits_t NCO1CONbits;

__at(0x0593) __sfr NCO1CLK;
__at(0x0593) volatile __NCO1CLKbits_t NCO1CLKbits;

__at(0x060C) __sfr CWG1CLKCON;
__at(0x060C) volatile __CWG1CLKCONbits_t CWG1CLKCONbits;

__at(0x060D) __sfr CWG1ISM;
__at(0x060D) volatile __CWG1ISMbits_t CWG1ISMbits;

__at(0x060E) __sfr CWG1DBR;
__at(0x060E) volatile __CWG1DBRbits_t CWG1DBRbits;

__at(0x060F) __sfr CWG1DBF;
__at(0x060F) volatile __CWG1DBFbits_t CWG1DBFbits;

