OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf18855.c
__at(0x0610) __sfr CWG1CON0;
__at(0x0610) volatile __CWG1CON0bits_t CWG1CON0bits;

__at(0x0611) __sfr CWG1CON1;
__at(0x0611) volatile __CWG1CON1bits_t CWG1CON1bits;

__at(0x0612) __sfr CWG1AS0;
__at(0x0612) volatile __CWG1AS0bits_t CWG1AS0bits;

__at(0x0613) __sfr CWG1AS1;
__at(0x0613) volatile __CWG1AS1bits_t CWG1AS1bits;

__at(0x0614) __sfr CWG1STR;
__at(0x0614) volatile __CWG1STRbits_t CWG1STRbits;

__at(0x0616) __sfr CWG2CLKCON;
__at(0x0616) volatile __CWG2CLKCONbits_t CWG2CLKCONbits;

__at(0x0617) __sfr CWG2ISM;
__at(0x0617) volatile __CWG2ISMbits_t CWG2ISMbits;

__at(0x0618) __sfr CWG2DBR;
__at(0x0618) volatile __CWG2DBRbits_t CWG2DBRbits;

__at(0x0619) __sfr CWG2DBF;
__at(0x0619) volatile __CWG2DBFbits_t CWG2DBFbits;

__at(0x061A) __sfr CWG2CON0;
__at(0x061A) volatile __CWG2CON0bits_t CWG2CON0bits;

__at(0x061B) __sfr CWG2CON1;
__at(0x061B) volatile __CWG2CON1bits_t CWG2CON1bits;

__at(0x061C) __sfr CWG2AS0;
__at(0x061C) volatile __CWG2AS0bits_t CWG2AS0bits;

__at(0x061D) __sfr CWG2AS1;
__at(0x061D) volatile __CWG2AS1bits_t CWG2AS1bits;

__at(0x061E) __sfr CWG2STR;
__at(0x061E) volatile __CWG2STRbits_t CWG2STRbits;

__at(0x068C) __sfr CWG3CLKCON;
__at(0x068C) volatile __CWG3CLKCONbits_t CWG3CLKCONbits;

__at(0x068D) __sfr CWG3ISM;
__at(0x068D) volatile __CWG3ISMbits_t CWG3ISMbits;

__at(0x068E) __sfr CWG3DBR;
__at(0x068E) volatile __CWG3DBRbits_t CWG3DBRbits;

__at(0x068F) __sfr CWG3DBF;
__at(0x068F) volatile __CWG3DBFbits_t CWG3DBFbits;

__at(0x0690) __sfr CWG3CON0;
__at(0x0690) volatile __CWG3CON0bits_t CWG3CON0bits;

__at(0x0691) __sfr CWG3CON1;
__at(0x0691) volatile __CWG3CON1bits_t CWG3CON1bits;

__at(0x0692) __sfr CWG3AS0;
__at(0x0692) volatile __CWG3AS0bits_t CWG3AS0bits;

__at(0x0693) __sfr CWG3AS1;
__at(0x0693) volatile __CWG3AS1bits_t CWG3AS1bits;

__at(0x0694) __sfr CWG3STR;
__at(0x0694) volatile __CWG3STRbits_t CWG3STRbits;

__at(0x070C) __sfr PIR0;
__at(0x070C) volatile __PIR0bits_t PIR0bits;

__at(0x070D) __sfr PIR1;
__at(0x070D) volatile __PIR1bits_t PIR1bits;

__at(0x070E) __sfr PIR2;
__at(0x070E) volatile __PIR2bits_t PIR2bits;

__at(0x070F) __sfr PIR3;
__at(0x070F) volatile __PIR3bits_t PIR3bits;

__at(0x0710) __sfr PIR4;
__at(0x0710) volatile __PIR4bits_t PIR4bits;

__at(0x0711) __sfr PIR5;
__at(0x0711) volatile __PIR5bits_t PIR5bits;

__at(0x0712) __sfr PIR6;
__at(0x0712) volatile __PIR6bits_t PIR6bits;

__at(0x0713) __sfr PIR7;
__at(0x0713) volatile __PIR7bits_t PIR7bits;

__at(0x0714) __sfr PIR8;
__at(0x0714) volatile __PIR8bits_t PIR8bits;

__at(0x0716) __sfr PIE0;
__at(0x0716) volatile __PIE0bits_t PIE0bits;

__at(0x0717) __sfr PIE1;
__at(0x0717) volatile __PIE1bits_t PIE1bits;

__at(0x0718) __sfr PIE2;
__at(0x0718) volatile __PIE2bits_t PIE2bits;

__at(0x0719) __sfr PIE3;
__at(0x0719) volatile __PIE3bits_t PIE3bits;

__at(0x071A) __sfr PIE4;
__at(0x071A) volatile __PIE4bits_t PIE4bits;

__at(0x071B) __sfr PIE5;
__at(0x071B) volatile __PIE5bits_t PIE5bits;

__at(0x071C) __sfr PIE6;
__at(0x071C) volatile __PIE6bits_t PIE6bits;

__at(0x071D) __sfr PIE7;
__at(0x071D) volatile __PIE7bits_t PIE7bits;

__at(0x071E) __sfr PIE8;
__at(0x071E) volatile __PIE8bits_t PIE8bits;

__at(0x0796) __sfr PMD0;
__at(0x0796) volatile __PMD0bits_t PMD0bits;

__at(0x0797) __sfr PMD1;
__at(0x0797) volatile __PMD1bits_t PMD1bits;

__at(0x0798) __sfr PMD2;
__at(0x0798) volatile __PMD2bits_t PMD2bits;

__at(0x0799) __sfr PMD3;
__at(0x0799) volatile __PMD3bits_t PMD3bits;

__at(0x079A) __sfr PMD4;
__at(0x079A) volatile __PMD4bits_t PMD4bits;

__at(0x079B) __sfr PMD5;
__at(0x079B) volatile __PMD5bits_t PMD5bits;

__at(0x080C) __sfr WDTCON0;
__at(0x080C) volatile __WDTCON0bits_t WDTCON0bits;

__at(0x080D) __sfr WDTCON1;
__at(0x080D) volatile __WDTCON1bits_t WDTCON1bits;

__at(0x080E) __sfr WDTPSL;
__at(0x080E) volatile __WDTPSLbits_t WDTPSLbits;

__at(0x080F) __sfr WDTPSH;
__at(0x080F) volatile __WDTPSHbits_t WDTPSHbits;

__at(0x0810) __sfr WDTTMR;
__at(0x0810) volatile __WDTTMRbits_t WDTTMRbits;

__at(0x0811) __sfr BORCON;
__at(0x0811) volatile __BORCONbits_t BORCONbits;

__at(0x0813) __sfr PCON0;
__at(0x0813) volatile __PCON0bits_t PCON0bits;

__at(0x0814) __sfr CCDCON;
__at(0x0814) volatile __CCDCONbits_t CCDCONbits;

__at(0x081A) __sfr NVMADRL;
__at(0x081A) volatile __NVMADRLbits_t NVMADRLbits;

__at(0x081B) __sfr NVMADRH;
__at(0x081B) volatile __NVMADRHbits_t NVMADRHbits;

__at(0x081C) __sfr NVMDATL;
__at(0x081C) volatile __NVMDATLbits_t NVMDATLbits;

__at(0x081D) __sfr NVMDATH;
__at(0x081D) volatile __NVMDATHbits_t NVMDATHbits;

__at(0x081E) __sfr NVMCON1;
__at(0x081E) volatile __NVMCON1bits_t NVMCON1bits;

__at(0x081F) __sfr NVMCON2;

__at(0x088C) __sfr CPUDOZE;
__at(0x088C) volatile __CPUDOZEbits_t CPUDOZEbits;

__at(0x088D) __sfr OSCCON1;
__at(0x088D) volatile __OSCCON1bits_t OSCCON1bits;

__at(0x088E) __sfr OSCCON2;
__at(0x088E) volatile __OSCCON2bits_t OSCCON2bits;

__at(0x088F) __sfr OSCCON3;
__at(0x088F) volatile __OSCCON3bits_t OSCCON3bits;

__at(0x0890) __sfr OSCSTAT;
__at(0x0890) volatile __OSCSTATbits_t OSCSTATbits;

__at(0x0891) __sfr OSCEN;
__at(0x0891) volatile __OSCENbits_t OSCENbits;

__at(0x0892) __sfr OSCTUNE;
__at(0x0892) volatile __OSCTUNEbits_t OSCTUNEbits;

__at(0x0893) __sfr OSCFRQ;
__at(0x0893) volatile __OSCFRQbits_t OSCFRQbits;

__at(0x0895) __sfr CLKRCON;
__at(0x0895) volatile __CLKRCONbits_t CLKRCONbits;

__at(0x0896) __sfr CLKRCLK;
__at(0x0896) volatile __CLKRCLKbits_t CLKRCLKbits;

__at(0x0897) __sfr MDCON0;
__at(0x0897) volatile __MDCON0bits_t MDCON0bits;

__at(0x0898) __sfr MDCON1;
__at(0x0898) volatile __MDCON1bits_t MDCON1bits;

__at(0x0899) __sfr MDSRC;
__at(0x0899) volatile __MDSRCbits_t MDSRCbits;

__at(0x089A) __sfr MDCARL;
__at(0x089A) volatile __MDCARLbits_t MDCARLbits;

__at(0x089B) __sfr MDCARH;
__at(0x089B) volatile __MDCARHbits_t MDCARHbits;

__at(0x090C) __sfr FVRCON;
__at(0x090C) volatile __FVRCONbits_t FVRCONbits;

__at(0x090E) __sfr DAC1CON0;
__at(0x090E) volatile __DAC1CON0bits_t DAC1CON0bits;

__at(0x090F) __sfr DAC1CON1;
__at(0x090F) volatile __DAC1CON1bits_t DAC1CON1bits;

__at(0x091F) __sfr ZCD1CON;
__at(0x091F) volatile __ZCD1CONbits_t ZCD1CONbits;

__at(0x091F) __sfr ZCDCON;
__at(0x091F) volatile __ZCDCONbits_t ZCDCONbits;

__at(0x098F) __sfr CMOUT;
__at(0x098F) volatile __CMOUTbits_t CMOUTbits;

__at(0x098F) __sfr CMSTAT;
__at(0x098F) volatile __CMSTATbits_t CMSTATbits;

__at(0x0990) __sfr CM1CON0;
__at(0x0990) volatile __CM1CON0bits_t CM1CON0bits;

__at(0x0991) __sfr CM1CON1;
__at(0x0991) volatile __CM1CON1bits_t CM1CON1bits;

__at(0x0992) __sfr CM1NSEL;
__at(0x0992) volatile __CM1NSELbits_t CM1NSELbits;

__at(0x0993) __sfr CM1PSEL;
__at(0x0993) volatile __CM1PSELbits_t CM1PSELbits;

__at(0x0994) __sfr CM2CON0;
__at(0x0994) volatile __CM2CON0bits_t CM2CON0bits;

