OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16lf18855.c
__at(0x0995) __sfr CM2CON1;
__at(0x0995) volatile __CM2CON1bits_t CM2CON1bits;

__at(0x0996) __sfr CM2NSEL;
__at(0x0996) volatile __CM2NSELbits_t CM2NSELbits;

__at(0x0997) __sfr CM2PSEL;
__at(0x0997) volatile __CM2PSELbits_t CM2PSELbits;

__at(0x0E0F) __sfr CLCDATA;
__at(0x0E0F) volatile __CLCDATAbits_t CLCDATAbits;

__at(0x0E10) __sfr CLC1CON;
__at(0x0E10) volatile __CLC1CONbits_t CLC1CONbits;

__at(0x0E11) __sfr CLC1POL;
__at(0x0E11) volatile __CLC1POLbits_t CLC1POLbits;

__at(0x0E12) __sfr CLC1SEL0;
__at(0x0E12) volatile __CLC1SEL0bits_t CLC1SEL0bits;

__at(0x0E13) __sfr CLC1SEL1;
__at(0x0E13) volatile __CLC1SEL1bits_t CLC1SEL1bits;

__at(0x0E14) __sfr CLC1SEL2;
__at(0x0E14) volatile __CLC1SEL2bits_t CLC1SEL2bits;

__at(0x0E15) __sfr CLC1SEL3;
__at(0x0E15) volatile __CLC1SEL3bits_t CLC1SEL3bits;

__at(0x0E16) __sfr CLC1GLS0;
__at(0x0E16) volatile __CLC1GLS0bits_t CLC1GLS0bits;

__at(0x0E17) __sfr CLC1GLS1;
__at(0x0E17) volatile __CLC1GLS1bits_t CLC1GLS1bits;

__at(0x0E18) __sfr CLC1GLS2;
__at(0x0E18) volatile __CLC1GLS2bits_t CLC1GLS2bits;

__at(0x0E19) __sfr CLC1GLS3;
__at(0x0E19) volatile __CLC1GLS3bits_t CLC1GLS3bits;

__at(0x0E1A) __sfr CLC2CON;
__at(0x0E1A) volatile __CLC2CONbits_t CLC2CONbits;

__at(0x0E1B) __sfr CLC2POL;
__at(0x0E1B) volatile __CLC2POLbits_t CLC2POLbits;

__at(0x0E1C) __sfr CLC2SEL0;
__at(0x0E1C) volatile __CLC2SEL0bits_t CLC2SEL0bits;

__at(0x0E1D) __sfr CLC2SEL1;
__at(0x0E1D) volatile __CLC2SEL1bits_t CLC2SEL1bits;

__at(0x0E1E) __sfr CLC2SEL2;
__at(0x0E1E) volatile __CLC2SEL2bits_t CLC2SEL2bits;

__at(0x0E1F) __sfr CLC2SEL3;
__at(0x0E1F) volatile __CLC2SEL3bits_t CLC2SEL3bits;

__at(0x0E20) __sfr CLC2GLS0;
__at(0x0E20) volatile __CLC2GLS0bits_t CLC2GLS0bits;

__at(0x0E21) __sfr CLC2GLS1;
__at(0x0E21) volatile __CLC2GLS1bits_t CLC2GLS1bits;

__at(0x0E22) __sfr CLC2GLS2;
__at(0x0E22) volatile __CLC2GLS2bits_t CLC2GLS2bits;

__at(0x0E23) __sfr CLC2GLS3;
__at(0x0E23) volatile __CLC2GLS3bits_t CLC2GLS3bits;

__at(0x0E24) __sfr CLC3CON;
__at(0x0E24) volatile __CLC3CONbits_t CLC3CONbits;

__at(0x0E25) __sfr CLC3POL;
__at(0x0E25) volatile __CLC3POLbits_t CLC3POLbits;

__at(0x0E26) __sfr CLC3SEL0;
__at(0x0E26) volatile __CLC3SEL0bits_t CLC3SEL0bits;

__at(0x0E27) __sfr CLC3SEL1;
__at(0x0E27) volatile __CLC3SEL1bits_t CLC3SEL1bits;

__at(0x0E28) __sfr CLC3SEL2;
__at(0x0E28) volatile __CLC3SEL2bits_t CLC3SEL2bits;

__at(0x0E29) __sfr CLC3SEL3;
__at(0x0E29) volatile __CLC3SEL3bits_t CLC3SEL3bits;

__at(0x0E2A) __sfr CLC3GLS0;
__at(0x0E2A) volatile __CLC3GLS0bits_t CLC3GLS0bits;

__at(0x0E2B) __sfr CLC3GLS1;
__at(0x0E2B) volatile __CLC3GLS1bits_t CLC3GLS1bits;

__at(0x0E2C) __sfr CLC3GLS2;
__at(0x0E2C) volatile __CLC3GLS2bits_t CLC3GLS2bits;

__at(0x0E2D) __sfr CLC3GLS3;
__at(0x0E2D) volatile __CLC3GLS3bits_t CLC3GLS3bits;

__at(0x0E2E) __sfr CLC4CON;
__at(0x0E2E) volatile __CLC4CONbits_t CLC4CONbits;

__at(0x0E2F) __sfr CLC4POL;
__at(0x0E2F) volatile __CLC4POLbits_t CLC4POLbits;

__at(0x0E30) __sfr CLC4SEL0;
__at(0x0E30) volatile __CLC4SEL0bits_t CLC4SEL0bits;

__at(0x0E31) __sfr CLC4SEL1;
__at(0x0E31) volatile __CLC4SEL1bits_t CLC4SEL1bits;

__at(0x0E32) __sfr CLC4SEL2;
__at(0x0E32) volatile __CLC4SEL2bits_t CLC4SEL2bits;

__at(0x0E33) __sfr CLC4SEL3;
__at(0x0E33) volatile __CLC4SEL3bits_t CLC4SEL3bits;

__at(0x0E34) __sfr CLC4GLS0;
__at(0x0E34) volatile __CLC4GLS0bits_t CLC4GLS0bits;

__at(0x0E35) __sfr CLC4GLS1;
__at(0x0E35) volatile __CLC4GLS1bits_t CLC4GLS1bits;

__at(0x0E36) __sfr CLC4GLS2;
__at(0x0E36) volatile __CLC4GLS2bits_t CLC4GLS2bits;

__at(0x0E37) __sfr CLC4GLS3;
__at(0x0E37) volatile __CLC4GLS3bits_t CLC4GLS3bits;

__at(0x0E8F) __sfr PPSLOCK;
__at(0x0E8F) volatile __PPSLOCKbits_t PPSLOCKbits;

__at(0x0E90) __sfr INTPPS;
__at(0x0E90) volatile __INTPPSbits_t INTPPSbits;

__at(0x0E91) __sfr T0CKIPPS;
__at(0x0E91) volatile __T0CKIPPSbits_t T0CKIPPSbits;

__at(0x0E92) __sfr T1CKIPPS;
__at(0x0E92) volatile __T1CKIPPSbits_t T1CKIPPSbits;

__at(0x0E93) __sfr T1GPPS;
__at(0x0E93) volatile __T1GPPSbits_t T1GPPSbits;

__at(0x0E94) __sfr T3CKIPPS;
__at(0x0E94) volatile __T3CKIPPSbits_t T3CKIPPSbits;

__at(0x0E95) __sfr T3GPPS;
__at(0x0E95) volatile __T3GPPSbits_t T3GPPSbits;

__at(0x0E96) __sfr T5CKIPPS;
__at(0x0E96) volatile __T5CKIPPSbits_t T5CKIPPSbits;

__at(0x0E97) __sfr T5GPPS;
__at(0x0E97) volatile __T5GPPSbits_t T5GPPSbits;

__at(0x0E9C) __sfr T2AINPPS;
__at(0x0E9C) volatile __T2AINPPSbits_t T2AINPPSbits;

__at(0x0E9D) __sfr T4AINPPS;
__at(0x0E9D) volatile __T4AINPPSbits_t T4AINPPSbits;

__at(0x0E9E) __sfr T6AINPPS;
__at(0x0E9E) volatile __T6AINPPSbits_t T6AINPPSbits;

__at(0x0EA1) __sfr CCP1PPS;
__at(0x0EA1) volatile __CCP1PPSbits_t CCP1PPSbits;

__at(0x0EA2) __sfr CCP2PPS;
__at(0x0EA2) volatile __CCP2PPSbits_t CCP2PPSbits;

__at(0x0EA3) __sfr CCP3PPS;
__at(0x0EA3) volatile __CCP3PPSbits_t CCP3PPSbits;

__at(0x0EA4) __sfr CCP4PPS;
__at(0x0EA4) volatile __CCP4PPSbits_t CCP4PPSbits;

__at(0x0EA5) __sfr CCP5PPS;
__at(0x0EA5) volatile __CCP5PPSbits_t CCP5PPSbits;

__at(0x0EA9) __sfr SMT1WINPPS;
__at(0x0EA9) volatile __SMT1WINPPSbits_t SMT1WINPPSbits;

__at(0x0EAA) __sfr SMT1SIGPPS;
__at(0x0EAA) volatile __SMT1SIGPPSbits_t SMT1SIGPPSbits;

__at(0x0EAB) __sfr SMT2WINPPS;
__at(0x0EAB) volatile __SMT2WINPPSbits_t SMT2WINPPSbits;

__at(0x0EAC) __sfr SMT2SIGPPS;
__at(0x0EAC) volatile __SMT2SIGPPSbits_t SMT2SIGPPSbits;

__at(0x0EB1) __sfr CWG1PPS;
__at(0x0EB1) volatile __CWG1PPSbits_t CWG1PPSbits;

__at(0x0EB2) __sfr CWG2PPS;
__at(0x0EB2) volatile __CWG2PPSbits_t CWG2PPSbits;

__at(0x0EB3) __sfr CWG3PPS;
__at(0x0EB3) volatile __CWG3PPSbits_t CWG3PPSbits;

__at(0x0EB8) __sfr MDCARLPPS;
__at(0x0EB8) volatile __MDCARLPPSbits_t MDCARLPPSbits;

__at(0x0EB9) __sfr MDCARHPPS;
__at(0x0EB9) volatile __MDCARHPPSbits_t MDCARHPPSbits;

__at(0x0EBA) __sfr MDSRCPPS;
__at(0x0EBA) volatile __MDSRCPPSbits_t MDSRCPPSbits;

__at(0x0EBB) __sfr CLCIN0PPS;
__at(0x0EBB) volatile __CLCIN0PPSbits_t CLCIN0PPSbits;

__at(0x0EBC) __sfr CLCIN1PPS;
__at(0x0EBC) volatile __CLCIN1PPSbits_t CLCIN1PPSbits;

__at(0x0EBD) __sfr CLCIN2PPS;
__at(0x0EBD) volatile __CLCIN2PPSbits_t CLCIN2PPSbits;

__at(0x0EBE) __sfr CLCIN3PPS;
__at(0x0EBE) volatile __CLCIN3PPSbits_t CLCIN3PPSbits;

